/*
১. দেখো যে কানেকশন স্ট্রিং ঠিক আছে কিনা। যদি কানেকশন স্ট্রিং এ <password> বা <dbname> এই টাইপের কিছু থাকে তাহলে সেটা ঠিক করতে হবে। 

২. যদি ইউজার বা পাসওয়ার্ড নিয়ে নিশ্চিত না হও তাহলে atlas এ গিয়ে ক্লাস্টার এর নিচে database একসেস এ গিয়ে নতুন ইউজার খুলে তার ইউজার নেম আর পাসওয়ার্ড দিয়ে ট্রাই করো 

৩. network access এ গিয়ে connect from anywhere দিয়ে দাও। IP এড্রেস ০.০.০.০.

৪. কোড এর মধ্যে সব ঠিক করে করছো কিনা ট্রাই করো। দরকার হলে কোড রিমুভ করে আবার নতুন করে শুরু করো। 

৫. চেক করো "client.close()" লেখা কমেন্ট করা আছে কিনা। 

৬. express, mongodb, cors ঠিকমতো ইন্স্টল্ করছো কিনা 

৭. middleware ঠিক মতো বসাইছো কিনা 

৮. nodemon এর সার্ভার Ctrl+C মেরে স্টপ করে আবার নতুন করে স্টার্ট করে দিয়ে দেখো। কাজ হয় কিনা।
*/